{"modelTopology":{"shape_name":"number1","iter_count":2000,"config":{"selectedNoiseType":"2D Uniform","noiseSize":2,"numGeneratorLayers":5,"numDiscriminatorLayers":6,"numGeneratorNeurons":128,"numDiscriminatorNeurons":128,"dLearningRate":0.03,"gLearningRate":0.01,"dOptimizerType":"SGD","gOptimizerType":"SGD","lossType":"LeastSq loss","kDSteps":2,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_number1.weights.bin"],"weights":[{"name":"d-0","shape":[2,128],"dtype":"float32"},{"name":"d-1","shape":[128],"dtype":"float32"},{"name":"d-2","shape":[128,128],"dtype":"float32"},{"name":"d-3","shape":[128],"dtype":"float32"},{"name":"d-4","shape":[128,128],"dtype":"float32"},{"name":"d-5","shape":[128],"dtype":"float32"},{"name":"d-6","shape":[128,128],"dtype":"float32"},{"name":"d-7","shape":[128],"dtype":"float32"},{"name":"d-8","shape":[128,128],"dtype":"float32"},{"name":"d-9","shape":[128],"dtype":"float32"},{"name":"d-10","shape":[128,128],"dtype":"float32"},{"name":"d-11","shape":[128],"dtype":"float32"},{"name":"d-12","shape":[128,128],"dtype":"float32"},{"name":"d-13","shape":[128],"dtype":"float32"},{"name":"d-14","shape":[128,1],"dtype":"float32"},{"name":"d-15","shape":[1],"dtype":"float32"},{"name":"g-0","shape":[2,128],"dtype":"float32"},{"name":"g-1","shape":[128],"dtype":"float32"},{"name":"g-2","shape":[128,128],"dtype":"float32"},{"name":"g-3","shape":[128],"dtype":"float32"},{"name":"g-4","shape":[128,128],"dtype":"float32"},{"name":"g-5","shape":[128],"dtype":"float32"},{"name":"g-6","shape":[128,128],"dtype":"float32"},{"name":"g-7","shape":[128],"dtype":"float32"},{"name":"g-8","shape":[128,128],"dtype":"float32"},{"name":"g-9","shape":[128],"dtype":"float32"},{"name":"g-10","shape":[128,128],"dtype":"float32"},{"name":"g-11","shape":[128],"dtype":"float32"},{"name":"g-12","shape":[128,2],"dtype":"float32"},{"name":"g-13","shape":[2],"dtype":"float32"}]}]}